'''运算符总共有 7 类：
算术运算符: +、-、*、%、/、//、**
比较运算符：==   ！=    >   <   >=    <=
逻辑运算符：not  and   or
赋值运算符：=   +=   -=    *=    %=    /=    //=     **=
成员运算符：in 、  not in
身份运算符：is 、 is not      判断两个变量是否引用自 同一个/不同 的对象
位运算符(为二进制准备的运算符):& 按位与运算符；| 按位或运算符；^ 按位异或运算符； ～ 按位取反运算符； << 右移动运算符；>> 左移动
'''

# a, b, c = 20, 30, 5
# a //= c
# b %= a
# print(b)

# 成员运算符的演示
# sheet = ['tom', 'jerry', 'kim']
# if 'tom' in sheet:
#     print('Y')
# else:
#     print('N')

# 身份运算符的演示
# a = 5
# b = a
# c = 5.0
# print(a is b)


'''二进制与十进制转换(面试常见)
二转十规则：从右到左用每位数乘以2的N次方（0开始）后累加
十转二规则： 用十进制对 2 取余，将余数放在二进制左侧
'''

# 位运算符的演示（面试常见）
# a = 60    # 60 的二进制：00111100
# b = 13    # 13 的二进制：00001101
# c = 0
# c = a & b
# print(c)
#
# c = a | b
# print(c)
#
# c = a ^ b
# print(c)
#
# c = a << 3
# print(c)


# a = 56  # 111000
# b = 19   # 10011
# c = a | b    # 111011
# print(c)